In [1]:
import numpy as np
import pandas as pd

### Pivot Tables

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    781     10   John  January      Q1
1  2023-01-02       B   West    908     23   Mary  January      Q1
2  2023-01-03       C  North    861     78    Bob  January      Q1
3  2023-01-04       D  South    735     22  Alice  January      Q1
4  2023-01-05       A   East    857     61   John  January      Q1
5  2023-01-06       B   West    912     71   Mary  January      Q1
6  2023-01-07       C  North    626     38    Bob  January      Q1
7  2023-01-08       D  South    611     39  Alice  January      Q1
8  2023-01-09       A   East    617     90   John  January      Q1
9  2023-01-10       B   West    646     64   Mary  January      Q1
10 2023-01-11       C  North    208     62    Bob  January      Q1
11 2023-01-12       D  South    740     45  Alice  January      Q1
12 2023-01-13       A   East    431     74   John  January      Q1
13 2023-01-14       B   West    186     40   Mary  January      Q1
14 2023-01-15       C  North    757     44    Bob  January      Q1
15 2023-01-16       D  South    285     89  Alice  January      Q1
16 2023-01-17       A   East    230     13   John  January      Q1
17 2023-01-18       B   West    510     97   Mary  January      Q1
18 2023-01-19       C  North    962     80    Bob  January      Q1
19 2023-01-20       D  South    724     37  Alice  January      Q1

In [3]:
pd.pivot_table(df,values = "Sales", index = "Region", columns = "Product", aggfunc = 'median')

Product      A      B      C      D
Region
East     617.0    NaN    NaN    NaN
North      NaN    NaN  757.0    NaN
South      NaN    NaN    NaN  724.0
West       NaN  646.0    NaN    NaN

In [4]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     583.2    NaN    NaN    NaN  49.6   NaN   NaN   NaN
North      NaN    NaN  682.8    NaN   NaN   NaN  60.4   NaN
South      NaN    NaN    NaN  619.0   NaN   NaN   NaN  46.4
West       NaN  632.4    NaN    NaN   NaN  59.0   NaN   NaN

### Cross Tabs

In [5]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    781     10   John  January      Q1
1  2023-01-02       B   West    908     23   Mary  January      Q1
2  2023-01-03       C  North    861     78    Bob  January      Q1
3  2023-01-04       D  South    735     22  Alice  January      Q1
4  2023-01-05       A   East    857     61   John  January      Q1
5  2023-01-06       B   West    912     71   Mary  January      Q1
6  2023-01-07       C  North    626     38    Bob  January      Q1
7  2023-01-08       D  South    611     39  Alice  January      Q1
8  2023-01-09       A   East    617     90   John  January      Q1
9  2023-01-10       B   West    646     64   Mary  January      Q1
10 2023-01-11       C  North    208     62    Bob  January      Q1
11 2023-01-12       D  South    740     45  Alice  January      Q1
12 2023-01-13       A   East    431     74   John  January      Q1
13 2023-01-14       B   West    186     40   Mary  January      Q1
14 2023-01-15       C  North    757     44    Bob  January      Q1
15 2023-01-16       D  South    285     89  Alice  January      Q1
16 2023-01-17       A   East    230     13   John  January      Q1
17 2023-01-18       B   West    510     97   Mary  January      Q1
18 2023-01-19       C  North    962     80    Bob  January      Q1
19 2023-01-20       D  South    724     37  Alice  January      Q1

In [6]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0